of-develop/BackStep/system/blockMeshDict
FoamFile
{
  version 2.0;
  format  ascii;
  class   dictionary;
  object  blockMeshDict;
}
vertices
(
  (-0.1 -0.03 -0.03)
  (1.1 -0.03 -0.03)
  (1.1 0.32999999999999996 -0.03)
  (-0.1 0.32999999999999996 -0.03)
  (-0.1 -0.03 0.32999999999999996)
  (1.1 -0.03 0.32999999999999996)
  (1.1 0.32999999999999996 0.32999999999999996)
  (-0.1 0.32999999999999996 0.32999999999999996)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (49 15 15) simpleGrading (1 1 1)
);
edges ();
patches ();
mergePatchPairs ();
