of-develop/BackStep/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  face1.stl
  {
    type triSurfaceMesh;
    name face1;
    regions
    {
      face1
      {
        name face1;
      }
    }
  }
  face2.stl
  {
    type triSurfaceMesh;
    name face2;
    regions
    {
      face2
      {
        name face2;
      }
    }
  }
  face3.stl
  {
    type triSurfaceMesh;
    name face3;
    regions
    {
      face3
      {
        name face3;
      }
    }
  }
  inlet.stl
  {
    type triSurfaceMesh;
    name inlet;
    regions
    {
      inlet
      {
        name inlet;
      }
    }
  }
  outlet.stl
  {
    type triSurfaceMesh;
    name outlet;
    regions
    {
      outlet
      {
        name outlet;
      }
    }
  }
  step1.stl
  {
    type triSurfaceMesh;
    name step1;
    regions
    {
      step1
      {
        name step1;
      }
    }
  }
  step2.stl
  {
    type triSurfaceMesh;
    name step2;
    regions
    {
      step2
      {
        name step2;
      }
    }
  }
  step3.stl
  {
    type triSurfaceMesh;
    name step3;
    regions
    {
      step3
      {
        name step3;
      }
    }
  }
  box0
  {
    type searchableBox;
    // Error epsilon is added/subtracted for stability.
    min (-1e-09 -1e-09 -1e-09);
    max (0.300000001 0.300000001 0.300000001);
  }
}
castellatedMeshControls
{
  features (
    {
      file "face1.eMesh";
      level 1;
    }
    {
      file "face2.eMesh";
      level 1;
    }
    {
      file "face3.eMesh";
      level 1;
    }
    {
      file "inlet.eMesh";
      level 1;
    }
    {
      file "outlet.eMesh";
      level 1;
    }
    {
      file "step1.eMesh";
      level 1;
    }
    {
      file "step2.eMesh";
      level 1;
    }
    {
      file "step3.eMesh";
      level 1;
    }
  );
  refinementSurfaces
  {
    face1
    {
      level (0 0);
      regions
      {
        face1
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face2
    {
      level (0 0);
      regions
      {
        face2
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face3
    {
      level (0 0);
      regions
      {
        face3
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    inlet
    {
      level (0 0);
      regions
      {
        inlet
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
      }
    }
    outlet
    {
      level (0 0);
      regions
      {
        outlet
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
      }
    }
    step1
    {
      level (0 0);
      regions
      {
        step1
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    step2
    {
      level (0 0);
      regions
      {
        step2
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    step3
    {
      level (0 0);
      regions
      {
        step3
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
  }
  refinementRegions
  {
    box0
    {
      mode inside;
      levels ((2 2));
    }
  }
  locationInMesh (0.5 0.14999999999999997 0.14999999999999997);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 3;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}
addLayersControls
{
  layers
  {
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
