of-develop/BackStep/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
transportModel  Newtonian;
nu  nu [0 2 -1 0 0 0 0] 1.511e-05;
