of-develop/BackStep/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    0;
    object      U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.0 0.0 0.0);
boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (10 0 0);
    }
    face1
    {
        type slip;
    }
    face2
    {
        type slip;
    }
    face3
    {
        type slip;
    }
    step1
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    step3
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    outlet
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }
    step2
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}
